#include <iostream>
using namespace std;
int main() {
	//Вывести четные числа от 1 до 100
	/*int i = 2;
	do {
		cout << i << " ";
		i += 2;
	} while (i <= 100);*/
	//Дано два целых положительных числа a, b (a < b).
	//Найти сумму нечетных чисел, пройдя диапазон a-b в порядке убывания
	/*int a, b, i, sum = 0;
	cin >> a >> b;
	i = b;
	do {
		if (i % 2 != 0) {
			sum += i;
		}
		i--;
	} while (i >= a);
	cout << sum;*/
	//Дано целое положительное число n. Вывести квадраты натуральных чисел, 
	//не большие n
	/*int i = 1, n;
	cin >> n;
	do {
		cout << i * i << " ";
		i++;
	} while (i*i <= n);*/
	/*
29. с помощью оператора do-while напишите программу вывода всех четных чисел в 
диапазоне от 2 до 100 включительно.

30. С помощью оператора do-while напишите программу определения суммы всех 
нечетных чисел в диапазоне от 1 до 99 включительно.

17. В ЭВМ вводятся по очереди данные о росте N учащихся класса. Определить 
средний рост учащихся класса.

18. Задано натуральное число N. Найти количество натуральных чисел, не 
превосходящих N и не делящихся ни на одно из чисел 2,3,5.

22. дано натуральное n. вычислить: 1 + 1/2 + 1/3 + 1/4 + ... + 1/n.
	*/
}